{
  "camera_card.png": "A single‑row card from the Cameras list. The preview thumbnail (left‑side view) is followed by the camera label “Left‑side / AI Omnicam,” its vehicle MTV_AABL36RC40…, an Unidentified driver, the last known location “Buffalo, New York – 01/12/2024,” and a bright‑red status pill reading Disconnected. File path: app/dashboard/safety/cameras/camera-card/camera-card.component.html",
  "camera_stats_dashcam.png": "The right‑rail statistics panel for Dashcams. It shows the total number of dashcams (128) and breaks them down by Type (Road‑facing 42, Dual‑facing 86) and by Status (Disconnected 6, Incompatible 2, Install issue 3, Obstructed camera 9, Installed 108). File path: app/dashboard/safety/cameras/cameras-summary/cameras-summary.component.html",
  "cameras_dashcam_list.png": "The Cameras page with the Dashcam tab selected. A filter bar across the top offers search by serial/vehicle, camera drop‑down, asset and status filters, plus a Reset link. The list area contains multiple dashcam rows—each with preview, model, vehicle, driver, location, and a red Disconnected status pill. The right side shows the dashcam statistics panel. File path: app/dashboard/safety/cameras/cameras.component.html",
  "cameras_filter_omnicam.png": "The filter bar when the AI Omnicam tab is active. Tabs for Dashcam and AI Omnicam appear left‑most; serial and vehicle search fields, Camera drop‑down, Asset and Status filters, and a Reset link are aligned in a single row. A sort pill on the right orders by Status. File path: app/dashboard/safety/cameras/cameras.component.html",
  "cameras_omnicams_list.png": "The Cameras page listing AI Omnicams. The AI Omnicam tab is highlighted, filters are applied, and multiple Omnicam rows appear—mostly ‘Left‑side’ or ‘Rear’ cameras—with Unidentified drivers and red Disconnected pills. The right‑hand stats panel summarizes totals for AI Omnicams (41), sidecams vs. rearcams, and status counts. File path: app/dashboard/safety/cameras/cameras.component.html",
  "Graph_component.png": "Dashboard card titled “Logs” showing a blue donut chart (4.3 K TOTAL LOGS) with legend: Compliant Logs 100 % 4.3 K, Non‑Compliant Logs 0 % 3.",
  "safety_drivers_filters.png": "Filter bar on the Safety › Drivers page. It shows a time‑range pill (Last 4 weeks) with chevrons, a Driver search drop‑down, a Safety Score drop‑down that is expanded to reveal score ranges (Super, Needs improvement, Poorest), a blue toggle pill Coachable behaviors only, and a Reset link. On the far right is a sort selector currently set to Driver. File path: app/dashboard/safety/drivers/list.component.html",
  "safety_drivers_list_item.png": "Single row from the Drivers list. The driver name is Unidentified (red text) with gray sub‑ID. A colored square badge shows the driver’s Safety Score, followed by metric values for Core Risk, Traffic Signals & Signs, Awareness, and Harsh Driving. Row background is light gray, indicating hover or active selection. File path: app/dashboard/safety/drivers/list.component.html",
  "safety_drivers_list.png": "Full Drivers list table in the Safety module. Columns include Driver/ID, Safety Score (badge style), Core Risk per 1k mi, Traffic Signals & Signs, Awareness, and Harsh Driving. The toolbar above repeats the date‑range, Driver search, Safety Score filter, Coachable behaviors toggle, and Reset link. A sort pill on the right orders by Driver. File path: app/dashboard/safety/drivers/list.component.html",
  "safety_event_card_confidential.png": "Single event row in the Safety › Events table. Columns: thumbnail preview, Behavior/Severity (\"Safe distancing\" with a red High label), Driver link, Vehicle, Date/Location, and Status. The status pill is light‑gray \"Dismissed\". Row is shaded light gray to mark selection/hover; a black tooltip is open, stating the event was tagged confidential (lock icon also visible). File path: app/dashboard/safety/events/event-card/event-card.component.html",
  "safety_events_filter_selected.png": "This image shows the filters for the events list page. It shows the date filter opened. Other filters include driver and vehicle search. Severity dropdown and behavior dropdown. We also have a confidential toggle filter to filter confidential events. File path: app/dashboard/safety/events/list.component.html",
  "safety_events_filters.png": "Compact Events filters row: date 04/29–05/05, unselected Driver/Vehicle chips, blue‑selected Severity (4) and Status (4), plus Confidential only chip. File name: app/dashboard/safety/events/list.component.html",
  "safety_events_list.png": "Events list page in the Safety module. A filter toolbar across the top contains a date‑range picker, Driver, Vehicle, Severity (blue badge showing 4 selected), Behavior, Status (4 selected), and a Confidential‑only toggle. Sort pill on the right orders by Date (latest). Below is a table of event rows with colored status pills such as Pending review (yellow), Coachable (pink), Dismissed (gray), and Coached (gray). File path: app/dashboard/safety/events/list.component.html",
  "safety_requests_filters.png": "Filter bar for the Safety › Requests page. Includes date‑range picker, Driver, Vehicle, Asset, Format drop‑down, and a Confidential‑only toggle pill. On the far right is a sort selector currently set to Request date (latest). File path: app/dashboard/safety/requests/list.component.html",
  "safety_requests_item_card.png": "Single request row in the Video Requests list. Shows clip thumbnail, Vehicle/Asset name with truck icon, Driver (red Unidentified), Length / Format (1 min Clip), Date/Location, Request Date/Requester, and a green Complete status pill. A kebab menu is open revealing option \"Download all videos\". File path: app/dashboard/safety/requests/list.component.html",
  "Screenshot_2025-03-26_at_2.50.10_PM.png": "Fuel Dashboard overview (Mar 17 – Mar 23): black summary bar with Avg MPG, Distance, Fuel Used, Util %, Idled Fuel, CO₂ cards; left panel line‑chart “Fuel Trends” vs fleet average; right panel “Fuel Efficiency Factors”; driver and vehicle performance tables below.",
  "Screenshot_2025-03-26_at_2.50.47_PM.png": "Safety overview page (Feb 24 – Mar 23): black KPI bar at top (distance, active drivers, events/mi, speeding, collisions); stacked bar Safety Trends chart with tooltip; table of ‘Unsafe Behaviors’; carousel of Recent Event thumbnails at bottom.",
  "Screenshot_2025-03-26_at_2.51.17_PM.png": "Compliance dashboard TODAY: black summary strip (Trip Hours, Distance, Active Drivers/Vehicles, HOS Violations, F&M Errors); three blue donut cards — Logs 4.3 K, Trips 12.7 K, Inspections 36.5 K; Top HOS Violations bar; risk leaderboards for log issues, reassigned trips, unidentified trips.",
  "Screenshot_2025-03-26_at_3.06.49_PM.png": "DOT BASIC performance screen: category tiles (Unsafe driving 7 %, Crash indicator 30 %, HOS compliance 22 %, etc.), percentile slider bars, donut ‘Out of Service Summary’ with 12 violations, table of ‘Top Violations’ last month.",
  "Screenshot_2025-05-05_at_6.04.13_PM.png": "Requests filter bar with date‑range chip ‘04/01 – 04/30’ expanded to show April 2025 calendar selection; additional chips Driver, Vehicle, Asset, Format, and blue ‘Confidential only’; list rows visible beneath."
}